Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Learn more about Elements in the documentation page for :ref:`<api> <xml_widget_element>`.
it_it: Per saperne di più sugli Elementi, consultare la pagina di documentazione per :ref:`<api> <xml_widget_element>`.

source: Learn more about `CSS Flexbox`_.
it_it: Maggiori informazioni su `CSS Flexbox`_.

source: Learn more about `CSS Grid`_ layout.
it_it: Maggiori informazioni sul layout `CSS Grid`_.

source: Learn more about `CSS Subgrid`_ layout.
it_it: Maggiori informazioni sul layout `CSS Subgrid`_.

source: Learn more about color formats in the :ref:`images_color_formats` section.
it_it: Per saperne di più sui formati colore, consultare la sezione :ref:`images_color_formats`.

source: Learn more about these in :ref:`xml_events_set_subject_value` and :ref:`xml_events_increment_subject_value`.
it_it: Per saperne di più, consultare :ref:`xml_events_set_subject_value` and :ref:`xml_events_increment_subject_value`.

source: Learn more at :ref:`indev_groups`.
it_it: Per saperne di più, visitare :ref:`indev_groups`.

source: Learn more in :ref:`Screen preview <xml_screen_preview>`
it_it: Per saperne di più, consultare :ref:`Anteprima di Screen <xml_screen_preview>`

source: Learn more in the :ref:`tick_interface` and :ref:`timer_handler` sections.
it_it: Per saperne di più, consultare le sezioni :ref:`tick_interface` e :ref:`timer_handler`.

source: Learn more on the :ref:`XML Events <xml_events_screen>` page.
it_it: Scoprire di più nella pagina degli :ref:`Eventi XML <xml_events_screen>`.

source: Learn more on the documentation page of :ref:`Observers <observer_how_to_use>`.
it_it: Ulteriori approfondimenti nella pagina di documentazione degli :ref:`Osservatori <observer_how_to_use>`.

source: Learn the Basics
it_it: Imparare le Basi

source: Left/right key events will be sent to the Widget that has focus.
it_it: Gli eventi dei tasti sinistro/destro verranno inviati al Widget che ha il focus.

source: Length of dashes (0 means no dashes --- a continuous line).
it_it: Lunghezza dei trattini (0 significa nessun tratto --- una linea continua).

source: Length of gaps between dashes (0 means no gaps --- a continuous line).
it_it: Lunghezza degli spazi tra i trattini (0 significa nessuno spazio, ovvero una linea continua).

source: Let us consider an example of an instrument which measures either voltage or current.
it_it: Consideriamo l'esempio di uno strumento che misura tensione o corrente.

source: Let's begin by creating a directory that will contain the ``Dockerfile`` and source code that will be used to build the image.
it_it: Iniziamo creando una directory che conterrà il ``Dockerfile`` e il codice sorgente che verrà utilizzato per creare l'immagine.

source: Let's dive into this recipe to understand what is done.
it_it: Approfondiamo questa ricetta per capire cosa viene fatto.

source: Let's dive right into an example!
it_it: Immergiamoci subito in un esempio!

source: Let's explore the contents of the output folder and what it contains.
it_it: Esploriamo il contenuto della cartella di output e cosa contiene.

source: Let's go through the build folders to understand what happened.
it_it: Esaminiamo le cartelle di build per capire cosa è successo.

source: Let's modify the configuration with ``menuconfig``.
it_it: Modifichiamo la configurazione con ``menuconfig``.

source: Let's say it has 10 rows each with 50 px height.
it_it: Supponiamo che abbia 10 righe, ciascuna con un'altezza di 50 px.

source: Let's say you have loaded a PNG image into a :cpp:struct:`lv_image_dsc_t` ``my_png`` variable and use it in an ``lv_image`` Widget.
it_it: Supponiamo di aver caricato un'immagine PNG in una variabile :cpp:struct:`lv_image_dsc_t` ``my_png`` e di averla utilizzata in un Widget ``lv_image``.

source: Let's see how it can be done in different cases.
it_it: Vediamo come farlo in casi diversi.

source: Let's see if there is already a configuration for RPi4 in Buildroot:
it_it: Vediamo se esiste già una configurazione per RPi4 in Buildroot:

source: Let's take a look at the index.rst file that is located in the docs/src/common-widget-features/layouts directory.
it_it: Diamo un'occhiata al file index.rst che si trova nella directory docs/src/common-widget-features/layouts.

source: Let's take as example the compilation of LVGL with DRM. The system must have ``libdrm`` installed.
it_it: Prendiamo come esempio la compilazione di LVGL con DRM. Il sistema deve avere ``libdrm`` installato.

source: Let's use the `STM32F429IDISCOVERY <https://www.st.com/en/evaluation-tools/32f429idiscovery.html>`__ as an example because it is a very popular board.
it_it: Usiamo la `STM32F429IDISCOVERY <https://www.st.com/en/evaluation-tools/32f429idiscovery.html>`__ come esempio, perché è una scheda molto popolare.

source: Let's use the `Windows Subsystem for Linux <https://acassis.wordpress.com/2018/01/10/how-to-build-nuttx-on-windows-10/>`__
it_it: Utilizziamo `Windows Subsystem for Linux <https://acassis.wordpress.com/2018/01/10/how-to-build-nuttx-on-windows-10/>`__

source: Let's use the letter 'Z' as the identifier character, and "path_to_file" as the path, then the path strings you pass to ``lv_fs_...()`` functions would look like this::
it_it: Usiamo la lettera 'Z' come carattere identificativo e "path_to_file" come percorso; le stringhe di percorso passate alle funzioni ``lv_fs_...()`` saranno simili a queste:

source: Lets install them using Ubuntu's package manager.
it_it: Installiamoli utilizzando il gestore pacchetti di Ubuntu.

source: Letter drawing
it_it: Disegno di lettere

source: Leveraging Zephyr Features
it_it: Sfruttare le funzionalità di Zephyr

source: Leveraging industry-standard frameworks like Yocto Project, Toradex enables customers to create tailored embedded systems with ease, ensuring compatibility and flexibility.
it_it: Sfruttando framework standard di settore come lo Yocto Project, Toradex consente ai clienti di creare sistemi embedded personalizzati con facilità, garantendo compatibilità e flessibilità.

source: Libinput handles device-specific quirks and provides an easy-to-use API to receive events from devices.
it_it: Libinput gestisce le peculiarità specifiche del dispositivo e fornisce un'API di facile utilizzo per ricevere eventi dai dispositivi.

source: Libinput is an input stack for processes that need to provide events from commonly used input devices.
it_it: Libinput è uno stack di input per processi che devono fornire eventi da dispositivi di input di uso comune.

source: Library source: https://github.com/libjpeg-turbo/libjpeg-turbo
it_it: Sorgenti della libreria: https://github.com/libjpeg-turbo/libjpeg-turbo

source: Library source: https://github.com/webmproject/libwebp
it_it: Sorgenti della libreria: https://github.com/webmproject/libwebp

source: Licence Selection
it_it: Selezione della Licenza

source: License
it_it: Licenza

source: Licensing
it_it: Licenza

source: Licensing and Permissions
it_it: Licenze e Autorizzazioni

source: Lightweight: A well-optimized interpreter with very little resources.
it_it: Leggero: Un interprete ben ottimizzato con risorse molto ridotte.

source: Lightweighted list from table
it_it: Elenco leggero da tabella

source: Like A8 but 16 alpha values
it_it: Come A8 ma 16 valori alfa

source: Like A8 but 4 alpha values
it_it: Come A8 ma 4 valori alfa

source: Like A8 but only 255 alpha or 0 alpha
it_it: Come A8 ma solo 255 alfa o 0 alfa

source: Like ARGB but alpha bytes are ignored
it_it: Come ARGB, ma i byte alfa vengono ignorati

source: Like Android's Fragment that must be hosted by an activity or another fragment, Fragment in LVGL needs to be hosted by a Widget, or another fragment.
it_it: Come il frammento di Android, che deve essere ospitato da un'attività o da un altro frammento, il frammento in LVGL deve essere ospitato da un Widget o da un altro frammento.

source: Like Bar, a Slider can be vertical or horizontal.
it_it: Come la Barra, uno Slider può essere verticale o orizzontale.

source: Like CSS, percentage values must be be followed by '%'.
it_it: Come in CSS, i valori percentuali devono essere seguiti da '%'.

source: Like in the previous task, this is handle by ``inherit cmake``.
it_it: Come nel task precedente, questa operazione viene gestita da ``inherit cmake``.

source: Like the Label Widget, a Spangroup can be set to one the following text-alignment modes:
it_it: Come il Widget Label, uno Spangroup può essere impostato su una delle seguenti modalità di allineamento del testo:

source: Like with bubbling, the *target* parameter of the event is always the current target Widget, not the original Widget.
it_it: Come con il bubbling, il parametro *target* dell'evento è sempre il Widget di destinazione corrente, non il Widget originale.

source: Limit animation render size
it_it: Limitare le dimensioni di rendering dell'animazione

source: Limit total # of frames in the animation
it_it: Limitare il numero totale di frame nell'animazione

source: Limit total number of frames, the longer the lottie animation is, the more memory it will consume for rendering (rlottie consumes IRAM for rendering).
it_it: Limitare il numero totale di frame: più lunga è l'animazione lottie, maggiore sarà la memoria che consumerà per il rendering (rlottie consuma IRAM per il rendering).

source: Limitation: The mask always aligns to the center, and only one bitmap mask can be used for an image/layer.
it_it: Limitazione: La maschera si allinea sempre al centro e per un'immagine/layer è possibile utilizzare una sola maschera bitmap.

source: Limitations
it_it: Limitazioni

source: Limitations:
it_it: Limitazioni:

source: Limiting Accepted Values
it_it: Limitazione dei Valori Accettati

source: Limiting Directory Access
it_it: Limitazione dell'Accesso alle Directory

source: Line 1: FPS, Total CPU%
it_it: Riga 1: FPS, Total CPU%

source: Line 2: Total time (Render | Flush)
it_it: Riga 2: Total time (Render | Flush)

source: Line Chart
it_it: Grafico a linee

source: Line Draw Descriptor
it_it: Descrittore di Disegno della Linea

# Line breaks can be used in the text like ``"Value 60.3"``.
source: Line breaks can be used in the text like ``"Value\n60.3"``.
it_it: È possibile utilizzare interruzioni di riga nel testo, ad esempio ``"Value\n60.3"``.

source: Line color.
it_it: Colore della linea.

source: Line drawing
it_it: Disegno di linee

source: Line opacity (0--255).
it_it: Opacità della linea (0-255).

source: Line styles
it_it: Stili per le Linee

source: Line thickness.
it_it: Spessore della linea.

source: Line wrap, recoloring and scrolling
it_it: A capo automatico, ricolorazione e scorrimento

source: Linear (Skew) Gradient
it_it: Gradiente (Obliquo) Lineare

source: Linear Gradient
it_it: Gradiente Lineare

source: Linear Gradients
it_it: Gradienti Lineari

source: Linear, radial, and conic gradients are defined between two points or angles.
it_it: I gradienti lineari, radiali e conici sono definiti tra due punti o angoli.

source: Lines
it_it: Righe

source: Link against ``libdrm`` when building.
it_it: Linkare a ``libdrm`` durante la compilazione.

source: Link against ``libgbm`` when building.
it_it: Linkare a ``libgbm`` durante la compilazione.

source: Link against library: ``freetype`` (for GCC: ``-L/usr/local/lib -lfreetype``)
it_it: Link alla libreria: ``freetype`` (per GCC: ``-L/usr/local/lib -lfreetype``)

source: Linker Script
it_it: Script del Linker

source: Linking between Menu Pages
it_it: Collegamento tra Menu Page

source: Links
it_it: Link

source: Links directly to code (e.g. function documentation) are accomplished by using the In-Line Code Expressions documented above.
it_it: I link diretti al codice (ad esempio la documentazione delle funzioni) vengono realizzati utilizzando le "In-Line Code Expression" documentate sopra.

source: Linux Framebuffer Driver
it_it: Driver Framebuffer Linux

source: Linux OS is required to block the LVGL drawing thread and switch to another task or suspend the CPU for power savings.
it_it: È necessario il sistema operativo Linux per bloccare il thread di disegno LVGL e passare a un altro task o sospendere la CPU per risparmiare energia.

source: Linux with frame buffer device such as /dev/fb0.
it_it: Linux con device frame buffer come /dev/fb0.

source: Linux-like absolute path
it_it: Path assoluto simile a Linux

source: Linux-like relative path
it_it: Path relativo simile a Linux

source: List
it_it: Lista

source: List items
it_it: Elementi dell'elenco

source: List items are passed to the Roller as a string with :cpp:expr:`lv_roller_set_options(roller, string_list, LV_ROLLER_MODE_NORMAL)`.
it_it: Gli elementi della lista vengono passati al Roller come stringa con :cpp:expr:`lv_roller_set_options(roller, string_list, LV_ROLLER_MODE_NORMAL)`.

source: List of extra characters to add, e.g., ``"°ÁŐÚ"``.
it_it: Elenco di ulteriori caratteri da aggiungere, ad esempio ``"°ÁŐÚ"``.

source: Lists (e.g. of accepted parameter values) can be created by using the '-' character.
it_it: Gli elenchi (ad esempio, dei valori dei parametri accettati) possono essere creati utilizzando il carattere '-'.

source: LittleFS is a little fail-safe filesystem designed for microcontrollers and integrated in the Arduino framework when used with ESP32 and ESP8266.
it_it: LittleFS è un piccolo file system fail-safe progettato per microcontrollori e integrato nel framework Arduino quando utilizzato con ESP32 ed ESP8266.

source: Load XMLs at runtime using LVGL’s XML loader.
it_it: Caricare file XML in fase di esecuzione utilizzando il caricatore XML di LVGL.

source: Load a JPG image
it_it: Caricare un'immagine JPG

source: Load a Lottie animation from a file
it_it: Caricare un'animazione Lottie da un file

source: Load a Lottie animation from an array
it_it: Caricamento di un'animazione Lottie da un array

source: Load a Lottie animation from file
it_it: Caricamento di un'animazione Lottie da un file

source: Load a Lottie animation from raw data
it_it: Caricare un'animazione Lottie da dati grezzi

source: Load a font with Tiny_TTF from file
it_it: Caricare un font con Tiny_TTF da un file

source: Load and manage multiple glTF models in a single viewer:
it_it: Caricare e gestire più modelli glTF in un unico visualizzatore:

source: Load and render SVG data
it_it: Caricare e renderizzare dati SVG

source: Load and render SVG data from a file
it_it: Caricare e renderizzare dati SVG da un file

source: Load and render SVG data in a draw event
it_it: Caricare e renderizzare dati SVG in un evento di disegno

source: Load components at runtime
it_it: Caricamento dei componenti a runtime

source: Load multiple models in a single glTF object and modify their position, rotation and scale at runtime
it_it: Caricare più modelli in un singolo oggetto glTF e modifica la loro posizione, rotazione e scala in fase di esecuzione

source: Load the start screen.
it_it: Caricare la schermata iniziale.

source: Load them directly at runtime
it_it: Caricandoli direttamente in fase di esecuzione

source: Load your glTF 3D models directly into LVGL UIs for rich, immersive interfaces.
it_it: Carica i modelli 3D glTF direttamente nelle interfacce utente LVGL per interfacce ricche e immersive.

source: Loaded from XML
it_it: Caricati da XML

source: Loader with Arc
it_it: Loader con Arc

source: Loading Screens
it_it: Caricamento degli Screen

source: Loading XML Files at Runtime
it_it: Caricamento di File XML a Runtime

source: Loading from File
it_it: Caricamento da File

source: Loading from Memory
it_it: Caricamento dalla Memoria

source: Loading from data is not supported, so ``as_file`` is always considered ``true``.
it_it: Il caricamento dai dati non è supportato, quindi ``as_file`` è sempre considerato ``true``.

source: Loading glTF (.gltf) and binary GLB (.glb) files from local filesystem
it_it: Caricamento di file glTF (.gltf) e GLB binari (.glb) dal file system locale

source: Loading the UI
it_it: Caricamento dell'interfaccia utente

source: Loads a video from the internet using the gstreamer widget
it_it: Caricamento di un video da Internet utilizzando il widget gstreamer

source: Local Style Binding
it_it: Binding di Style Locale

source: Local Styles
it_it: Stili Locali

source: Local constants can be defined, and global constants can be used
it_it: È possibile definire costanti locali e utilizzare costanti globali.

source: Local files via file:// URIs
it_it: File locali tramite URI file://

source: Local style properties also can be added to Widgets.
it_it: È anche possibile aggiungere proprietà di stile locali ai Widget.

source: Local styles
it_it: Stili Locali

source: Local styles also support adding "selectors" to property names:
it_it: Anche gli stili locali supportano l'aggiunta di "selettori" ai nomi delle proprietà:

source: Local styles are like normal styles, but they can't be shared among other Widgets.
it_it: Gli stili locali sono come gli stili normali, ma non possono essere condivisi tra altri Widget.

source: Local styles can be defined, and global styles can be used
it_it: È possibile definire stili locali e utilizzare stili globali.

source: Local styles can be used directly, for example:
it_it: Gli stili locali possono essere utilizzati direttamente, ad esempio:

source: Locate the ``platform.txt`` file for your Arduino core.
it_it: ndividuare il file ``platform.txt`` per il core Arduino.

source: Locating your input device
it_it: Individuazione del dispositivo di input

source: LodePNG Decoder
it_it: Decoder LodePNG

source: Log Level
it_it: Livello di log

source: Log Output
it_it: Output del Log

source: Log output configuration: LVGL uses the :cpp:func:`LV_LOG` interface by default to output trace information.
it_it: Configurazione dell'output del log: LVGL utilizza l'interfaccia :cpp:func:`LV_LOG` per default per l'output delle informazioni di trace.

source: Long lines are wrapped and when the text becomes long enough, the Text Area can be scrolled.
it_it: Le righe lunghe vengono mandate a capo e, quando il testo diventa sufficientemente lungo, è possibile scorrere la "Text Area".

source: Long modes
it_it: Modalità lunghe

source: Lossless WebP: width × height × 4 bytes (ARGB8888 format)
it_it: WebP "lossless" [senza perdita di dati]: larghezza × altezza × 4 byte (formato ARGB8888)

source: Lossless compression
it_it: Compressione lossless

source: Lossy WebP: width × height × 4 bytes (ARGB8888 format)
it_it: WebP "lossy [con perdita di dati]: larghezza × altezza × 4 byte (formato ARGB8888)

source: Lossy compression with transparency
it_it: Compressione lossy con trasparenza

source: Lottie animations can be opened from JSON files by using :cpp:expr:`lv_lottie_set_src_file(lottie, "path/to/file.json")`.
it_it: Le animazioni Lottie possono essere aperte da file JSON utilizzando :cpp:expr:`lv_lottie_set_src_file(lottie, "path/to/file.json")`.

source: Lottie animations tend to use a large amount of CPU time and can use large portions of RAM. This will vary from lottie to lottie but in general for best performance:
it_it: Le animazioni Lottie tendono a utilizzare una grande quantità di CPU e possono richiedere grandi quantità di RAM. Questo varia da Lottie a Lottie, ma in generale per ottenere le migliori prestazioni:

source: Lottie is standard and popular format so you can find many animation files on the web.
it_it: Lottie è un formato standard e diffuso, quindi è possibile trovare molti file di animazione sul web.

source: Low (1 draw buffer)
it_it: Basso (1 draw buffer)

source: Lower resolution values (64-128) are more suitable for embedded systems
it_it: Valori di risoluzione più bassi (64-128) sono più adatti ai sistemi embedded

source: Lower the size of the *Display buffer*.
it_it: Ridurre la dimensione del *Display buffer*.

source: Lowercase letters with ``_`` separation are used for attribute names.
it_it: Per i nomi degli attributi vengono utilizzate lettere minuscole separate da ``_``.

source: Luminance: pixels express gray-scale value in range [0-255]
it_it: Luminanza: i pixel esprimono un valore in scala di grigi compreso tra [0 e 255]

source: MEMFS (read a file from a memory buffer)
it_it: MEMFS (legge un file da un buffer di memoria)

source: MHz was the highest SPI speed that worked during testing with the Riverdi board and the ESP32-S3.
it_it: MHz è stata la velocità SPI più elevata che ha funzionato durante i test con la scheda Riverdi e l'ESP32-S3.

source: MIPI Alliance published a series of specifications related to display devices, including DBI (Display Bus Interface), DSI (Display Serial Interface) and DCS (Display Command Set).
it_it: MIPI Alliance ha pubblicato una serie di specifiche relative ai dispositivi di visualizzazione, tra cui DBI (Display Bus Interface), DSI (Display Serial Interface) e DCS (Display Command Set).

source: MIPI was founded in 2003 by Arm, Intel, Nokia, Samsung, STMicroelectronics and Texas Instruments.
it_it: MIPI è stata fondata nel 2003 da Arm, Intel, Nokia, Samsung, STMicroelectronics e Texas Instruments.

source: MPU Drivers
it_it: Driver MPU

source: MPU Features
it_it: Funzionalità MPU

source: Magic number (must be LV_IMAGE_HEADER_MAGIC)
it_it: Un "magic number" (deve essere LV_IMAGE_HEADER_MAGIC)

source: Main Features
it_it: Caratteristiche Principali

source: Main Modules
it_it: Moduli Principali

source: Main Page: :cpp:type:`lv_menu_page`
it_it: Pagina Principale: :cpp:type:`lv_menu_page`

source: Main ``lv_obj`` container named ``"cont"``: "cont"
it_it: Contenitore principale ``lv_obj`` chiamato ``"cont"``: "cont"

source: Main container: :cpp:type:`lv_menu_main_cont`
it_it: Contenitore principale: :cpp:type:`lv_menu_main_cont`

source: Main container: :cpp:var:`lv_menu_main_cont_class`
it_it: Contenitore principale: :cpp:var:`lv_menu_main_cont_class`

source: Main container: :ref:`base_widget`
it_it: Contenitore principale: :ref:`base_widget`

source: Main header title: :ref:`lv_label` (default hidden)
it_it: Titolo dell'intestazione principale: :ref:`lv_label` (default hidden)

source: Main header: :cpp:type:`lv_menu_main_header_cont`
it_it: Intestazione principale: :cpp:type:`lv_menu_main_header_cont`

source: Main header: :cpp:var:`lv_menu_main_header_cont_class`
it_it: Intestazione principale: :cpp:var:`lv_menu_main_header_cont_class`

source: Mainly, the project generates the necessary protocols with the ``wayland-scanner`` utility.
it_it: Principalmente, il progetto genera i protocolli necessari con l'utility ``wayland-scanner``.

source: Maintains:
it_it: Gestisce:

source: Major releases: approximately yearly
it_it: Release major: circa una volta all'anno

source: Major version: incompatible API changes.
it_it: Versione major: modifiche API incompatibili.

source: Make LVGL accessible to a larger audience.
it_it: Rendere LVGL accessibile a un pubblico più vasto.

source: Make Widget higher on both sides with this value.
it_it: Questo valore alza il Widget su entrambi i lati.

source: Make Widget wider on both sides with this value.
it_it: Questo valore allarga il Widget su entrambi i lati.

source: Make an object draggable
it_it: Creare un oggetto trascinabile

source: Make and CMake
it_it: Make e CMake

source: Make changes to the config and exit using `Esc` or `Q`, and save your configuration.
it_it: Apportare le modifiche alla configurazione e uscire premendo `Esc` o `Q`, quindi salvare la configurazione.

source: Make end points of arcs rounded.
it_it: Arrotonda le estremità degli archi.

source: Make end points of the lines rounded.
it_it: Arrotonda le estremità delle linee.

source: Make functions ``static`` when not part of that object's public API (where possible).
it_it: Rendere le funzioni ``static`` quando non fanno parte dell'API pubblica di quell'oggetto (ove possibile).
